public class Main {
    public static void main(String[] args) {

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран

        // входные данные
        int amount = 10110;

        // логика программы
        int one = 20;
        var bonus = amount / one;

        System.out.println("Вам начислено " + bonus + " миль");

    }

}


